import React  from "react";
import closeimg from '../../assets/images/close_popup.png';

const NotePopup = ({isOpen , onClose}) => {

   
  return (
    <div className={`note_popup ${isOpen ? "note_popup open" : "note_popup"}`}> 
      <span className="close" onClick={onClose}><img src={closeimg} alt="" /></span>
      <div className="inner">
          <h2>הסבר על המסלולים</h2>
          <div className="col">
            <h3>ק"צ </h3>
            <p>ריבית קבועה צמודה למדד< br/>
      מסלול זה מאפשר לכם ליהנות מריבית קבועה לאורך כל תקופת ההלוואה, שאינה מושפעת משינויים בשוק. היתרון העיקרי הוא יציבות ותכנון תקציבי לטווח ארוך, משום שההחזר החודשי ידוע מראש ולא משתנה.</p>
          </div>
          <div className="col">
            <h3>פריים - ריבית פריים</h3>
              <p>מסלול הפריים הוא מסלול בריבית משתנה המבוססת על ריבית הפריים, שהיא ריבית בנק ישראל בתוספת מרווח קבוע של 1.5%. הריבית וההחזר החודשי במסלול זה עולים ויורדים בהתאם לשינויים בריבית בנק ישראל. מסלול זה מתאים למי שמוכן לקחת סיכון מסוים בתמורה לריבית התחלתית נמוכה יותר, ויש לו אפשרות לפרוע את ההלוואה בקלות יחסית וללא עמלת פירעון מוקדם בנקודות יציאה מסוימות.</p>
          </div>
          <div className="col">
            <h3>מ"צ</h3>  
            <p>ריבית משתנה צמודה למדד < br/>
            במסלול זה, גם הריבית וגם יתרת הקרן מושפעות משינויים במשק. הריבית נקבעת לפי מדד המחירים לצרכן ומשתנה במועדים קבועים מראש (למשל, כל 2, 5 או 10 שנים). מסלול זה מסוכן יותר כי הוא חשוף לעליית מדד האינפלציה, שעלולה להגדיל משמעותית את יתרת ההלוואה ואת ההחזר החודשי. עם זאת, במקרים מסוימים הוא יכול להציע ריבית התחלתית נמוכה יותר
            </p>
          </div>

      </div>
    </div>
  );
};

export default NotePopup;